In [171]:
from bs4 import BeautifulSoup
import requests
import pandas as pd
from pandas import Series,DataFrame
import warnings
warnings.filterwarnings('ignore')

In [172]:
url='https://www.mountain-forecast.com/countries/India?top100=yes'

In [173]:
# Request content from web page
result = requests.get(url)
c = result.content

# Set as Beautiful Soup Object
soup = BeautifulSoup(c)

In [174]:
# Go to the section of interest
summary = soup.find("ul",{'class':'b-list-table'})

# Find the tables in the HTML
tables = summary.find_all('a')

In [182]:
#summary.find("li",{'class':'b-list-table__item-height'})
#tag=tables.find_all('a')[0].get_text()
#print(soup1.prettify())
#summary.find_all('span')[0].get_text()
len(tables)

99

In [247]:
data=[]
for i in range(99):
    data.append(tables[i].get_text())
    #print(type(tables[i].get_text()))

In [249]:
data=pd.DataFrame(data,columns=['City_Names'])

In [234]:
summary1 = summary.find_all('span',{'class':'b-list-table__item-height'})
#find('b-list-table__item-height')

In [252]:
data1=[]
for i in range(99):
    data1.append(summary1[i].get_text())
#summary1[].get_text()

In [254]:
data['Heights']=pd.DataFrame(data1)

In [259]:
data.columns=['Mountains_names','Heights']

In [260]:
data.head()

       Mountains_names Heights
0            Abi Gamin  7355 m
1  Agasthyamalai Hills  1868 m
2         Agastya Mala  1868 m
3        Amarnath Peak  5186 m
4      Anaimalai Hills  2695 m

In [261]:
data.describe()

       Mountains_names Heights
count               99      99
unique              99      88
top         Bhagirathi  6904 m
freq                 1       3

In [262]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 2 columns):
Mountains_names    99 non-null object
Heights            99 non-null object
dtypes: object(2)
memory usage: 1.6+ KB

In [270]:
data.sort_values('Heights',ascending=False).head()

     Mountains_names Heights
58        Nanda Devi  7817 m
37             Kamet  7756 m
83      Saser Kangri  7672 m
84      Sasir Kangri  7672 m
45  Mamostong Kangri  7516 m